project/app/Controllers/Admin/SI_Contrato.php

SELECT `si_contrato`.*, `si_aluno`.`nome` as `aluno_nome`, `si_turma`.`nome` as `turma_nome`, `si_turma`.`ano` as `turma_ano`, `si_pai`.`rm_resp_financeiro_nome` as `responsavel_nome`
FROM `si_contrato`
JOIN `si_pai` ON `si_pai`.`id` = `si_contrato`.`id_responsavel`
JOIN `si_aluno` ON `si_aluno`.`id` = `si_contrato`.`id_aluno`
JOIN `si_turma` ON `si_turma`.`id` = `si_contrato`.`id_turma`
ORDER BY `si_turma`.`ano` DESC
---
    public function index()
    {
        $contratos = $this->contratoModel
            ->select('si_contrato.*, si_aluno.nome as aluno_nome, si_turma.nome as turma_nome, si_turma.ano as turma_ano, si_pai.rm_resp_financeiro_nome as responsavel_nome')
            ->join('si_pai', 'si_pai.id = si_contrato.id_responsavel')
            ->join('si_aluno', 'si_aluno.id = si_contrato.id_aluno')
            ->join('si_turma', 'si_turma.id = si_contrato.id_turma')
            ->orderBy('si_turma.ano', 'desc')
            ->findAll();

SELECT *
FROM `si_contrato`
WHERE `id_aluno` = '743'
AND `id_turma` = '401'
 LIMIT 1
SELECT *
FROM `si_aluno`
WHERE `si_aluno`.`id` = '832'
SELECT *
FROM `si_turma`
WHERE `si_turma`.`id` = '401'
SELECT *
FROM `si_aluno`
WHERE `si_aluno`.`id` = '743'
SELECT *
FROM `si_pai`
WHERE `si_pai`.`id` = '601'
---
    public function create($id_turma, $id_aluno)
    {
        $this->data['modo'] = 'cadastrar';
        $this->data['action'] = base_url('/Admin/Contrato/save');

        $contrato_vigente = $this->contratoModel->where(['id_aluno' => $id_aluno, 'id_turma' => $id_turma])->first();

        if ($contrato_vigente) {

            $this->data['modo'] = 'editar';
            $this->data['action'] = base_url('/Admin/Contrato/update/' . $contrato_vigente->id);




            $this->data['fields'] = $contrato_vigente;
            $this->data['fields']->valor_total = monetarioExibir($this->data['fields']->valor_total);
        }





        $this->data +=     [
            'turma'     => $this->turmaModel->find($id_turma),
            'aluno'     => $this->alunoModel->find($id_aluno),
        ];
        $this->data['responsavel'] =  $this->paisModel->find($this->data['aluno']->fk_pai);

INSERT INTO `si_contrato` (`id_aluno`, `id_turma`, `id_responsavel`, `tipo_contrato`, `status`, `data_inicio`, `data_fim`, `parcelas`, `dia_vencimento`, `valor_total`, `numero_contrato`, `created_at`, `updated_at`) VALUES ('832', '401', '669', '2', 1, '2026-01-01', '2026-12-22', '12', '10', '26101.20', '8326694012025', '2025-10-22 08:59:40', '2025-10-22 08:59:40')
---
    public function save()
    {
        helper('form');

        $alert = 'danger';
        $message = 'Não foi possível gerar o contrato!';

        if ($this->request->getMethod() === 'post') {

            $rules = $this->validation->setRules([
                'data_inicio'      => ['label' => 'Data Inicio', 'rules' => 'required'],
                'data_fim'         => ['label' => 'Data Final', 'rules' => 'required'],
                'parcelas'         => ['label' => 'Parcelas', 'rules' => 'required'],
                'dia_vencimento'   => ['label' => 'Dia Vencimento', 'rules' => 'required'],
                'valor_total'      => ['label' => 'Valor Total', 'rules' => 'required'],
                'id_aluno'         => ['label' => 'Aluno', 'rules' => 'required'],
                'id_responsavel'   => ['label' => 'Responsável Financeiro', 'rules' => 'required'],
                'id_turma'         => ['label' => 'Turma', 'rules' => 'required'],
                'tipo_contrato'    => ['label' => 'Tipo do Contrato', 'rules' => 'required']
            ]);

            if ($this->validation->withRequest($this->request)->run()) {

                $fields =     $this->request->getVar();

                $fields['valor_total'] = number_format((float)preg_replace('/[^\d]/', '', $fields['valor_total']) / 100, 2, '.', '');
                $fields['status'] = 1; // Aberto
                $fields['numero_contrato'] = $fields['id_aluno'] . $fields['id_responsavel'] . $fields['id_turma'] . date('Y');

                if ($this->contratoModel->insert($fields)) {

SELECT *
FROM `si_pagamentos`
WHERE `si_pagamentos`.`deleted_at` IS NULL
AND `si_pagamentos`.`id` = '11'
---
    public function editarPagamento($id_pagamento = null)
    {
        if (empty($id_pagamento)) {
            return redirect()->to(base_url('Admin/Contrato'))->with('error', 'Pagamento não encontrado!');
        }

        // Buscar pagamento
        $pagamento = $this->pagamentoModel->find($id_pagamento);