project/app/Controllers/Admin/SI_PaginasInternas.php

SELECT *
FROM `site_pagina`
---
    public function getPaginasInternas(){
        return $this->modelPagina->findAll();