project/app/Controllers/Admin/SI_Turma.php


        $turmaModel = new SI_TurmaModel();
        $anoAtual = date('Y');
        $this->data['turma'] = $turmaModel->where('ano > '.$anoAtual)
                                            ->where('status = 1')
                                            ->findAll();

        $this->data['turmaTransferir'] = $turmaModel->where('ano >= '.$anoAtual)
                                                    ->where('status = 1')
                                                    ->findAll();

        $this->data['turmaAtual'] = $turmaModel->find($idTurma);
---
SELECT *
FROM `si_turma`
WHERE `ano` > 2025
AND `status` = 1
SELECT *
FROM `si_turma`
WHERE `ano` >= 2025
AND `status` = 1
SELECT *
FROM `si_turma`
WHERE `si_turma`.`id` = '401'