project/app/Controllers/Admin/SI_VisaoGeralFinanceiro.php


        // Buscar dados para os filtros
        $tipos_lancamento = $this->tipoLancamentoModel->getTiposAtivos();
        $turmas = $this->turmaModel->orderBy('ano', 'DESC')->orderBy('nome', 'ASC')->findAll();
---
SELECT *
FROM `si_turma`
ORDER BY `ano` DESC, `nome` ASC