project/app/Models/Admin/SI_Parcelas_ContratoModel.php

SELECT *
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '24'
ORDER BY `data_vencimento` ASC
---
	public function getParcelasByContrato($id_contrato){
		return $this->where('id_contrato', $id_contrato)
					->orderBy('data_vencimento
					', 'ASC')
					->findAll();

SELECT SUM(`valor_parcela`) AS `valor_parcela`
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '24'
 LIMIT 1
---
	public function valorTotalParcelas($id_contrato){
		$result = $this->selectSum('valor_parcela')
					   ->where('id_contrato', $id_contrato)
					   ->first();