project/app/Models/Admin/SI_Parcelas_ContratoModel.php

	public function getParcelasByContratoComPagamentos($id_contrato){
		return $this->select('
				si_parcelas_contrato.*,
				(SELECT SUM(valor_pago)
				 FROM si_pagamentos
				 WHERE si_pagamentos.id_parcela = si_parcelas_contrato.id
				   AND si_pagamentos.status = "CONFIRMADO"
				) as total_pago,
				(SELECT COUNT(*)
				 FROM si_pagamentos
				 WHERE si_pagamentos.id_parcela = si_parcelas_contrato.id
				   AND si_pagamentos.status = "CONFIRMADO"
				) as qtd_pagamentos
			')
			->where('id_contrato', $id_contrato)
			->orderBy('data_vencimento', 'ASC')
			->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '24'

	public function valorTotalParcelas($id_contrato){
		$result = $this->selectSum('valor_parcela')
					   ->where('id_contrato', $id_contrato)
					   ->first();
---
SELECT SUM(`valor_parcela`) AS `valor_parcela`
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '21'
AND `si_parcelas_contrato`.`deleted_at` IS NULL
 LIMIT 1

	public function countParcelasByContrato($id_contrato){
		return $this->where('id_contrato', $id_contrato)
					->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '21'
AND `si_parcelas_contrato`.`deleted_at` IS NULL

	public function valorTotalRecebido($id_contrato){
		$db = \Config\Database::connect();
		$builder = $db->table('si_pagamentos');

		$result = $builder->select('SUM(valor_pago) as total_recebido')
						  ->join('si_parcelas_contrato', 'si_parcelas_contrato.id = si_pagamentos.id_parcela')
						  ->where('si_parcelas_contrato.id_contrato', $id_contrato)
						  ->where('si_pagamentos.status', 'CONFIRMADO')
						  ->get()
						  ->getRow();
---
SELECT SUM(valor_pago) as total_recebido
FROM `si_pagamentos`
JOIN `si_parcelas_contrato` ON `si_parcelas_contrato`.`id` = `si_pagamentos`.`id_parcela`
WHERE `si_parcelas_contrato`.`id_contrato` = '21'
AND `si_pagamentos`.`status` = 'CONFIRMADO'

	public function valorTotalVencido($id_contrato){
		$hoje = date('Y-m-d');

		// Buscar parcelas vencidas
		$parcelas_vencidas = $this->select('id, valor_parcela')
									->where('id_contrato', $id_contrato)
									->where('data_vencimento <', $hoje)
									->findAll();
---
SELECT `id`, `valor_parcela`
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '21'
AND `data_vencimento` < '2025-11-04'
AND `si_parcelas_contrato`.`deleted_at` IS NULL

	public function countParcelasByStatus($id_contrato, $status){
		return $this->where('id_contrato', $id_contrato)
					->where('status', $status)
					->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `si_parcelas_contrato`
WHERE `id_contrato` = '21'
AND `status` = 1
AND `si_parcelas_contrato`.`deleted_at` IS NULL