project/app/Models/Admin/SI_PagamentoModel.php

SELECT `si_pagamentos`.*, `si_formas_pagamentos`.`nome` as `forma_pagamento_nome`
FROM `si_pagamentos`
LEFT JOIN `si_formas_pagamentos` ON `si_formas_pagamentos`.`id` = `si_pagamentos`.`id_forma_pagamento`
WHERE `si_pagamentos`.`id_parcela` = '44'
AND `si_pagamentos`.`status` != 'ESTORNADO'
AND `si_pagamentos`.`deleted_at` IS NULL
ORDER BY `si_pagamentos`.`data_pagamento` DESC, `si_pagamentos`.`created_at` DESC
---
    public function getPagamentosByParcela($id_parcela)
    {
        return $this->select('si_pagamentos.*, si_formas_pagamentos.nome as forma_pagamento_nome')
            ->join('si_formas_pagamentos', 'si_formas_pagamentos.id = si_pagamentos.id_forma_pagamento', 'left')
            ->where('si_pagamentos.id_parcela', $id_parcela)
            ->where('si_pagamentos.status !=', 'ESTORNADO')
            ->orderBy('si_pagamentos.data_pagamento', 'DESC')
            ->orderBy('si_pagamentos.created_at', 'DESC')
            ->findAll();

SELECT SUM(`valor_pago`) AS `valor_pago`
FROM `si_pagamentos`
WHERE `id_parcela` = '97'
AND `status` = 'CONFIRMADO'
AND `si_pagamentos`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getTotalPagoParcela($id_parcela)
    {
        $result = $this->selectSum('valor_pago')
            ->where('id_parcela', $id_parcela)
            ->where('status', 'CONFIRMADO')
            ->first();

SELECT `si_pagamentos`.*, `si_formas_pagamentos`.`nome` as `forma_pagamento_nome`, `si_parcelas_contrato`.`numero_parcela`, `si_parcelas_contrato`.`tipo_lancamento`
FROM `si_pagamentos`
LEFT JOIN `si_parcelas_contrato` ON `si_parcelas_contrato`.`id` = `si_pagamentos`.`id_parcela`
LEFT JOIN `si_formas_pagamentos` ON `si_formas_pagamentos`.`id` = `si_pagamentos`.`id_forma_pagamento`
WHERE `si_parcelas_contrato`.`id_contrato` = '21'
AND `si_pagamentos`.`status` != 'ESTORNADO'
AND `si_pagamentos`.`deleted_at` IS NULL
ORDER BY `si_pagamentos`.`data_pagamento` DESC
---
    public function getPagamentosByContrato($id_contrato)
    {
        return $this->select('
                si_pagamentos.*,
                si_formas_pagamentos.nome as forma_pagamento_nome,
                si_parcelas_contrato.numero_parcela,
                si_parcelas_contrato.tipo_lancamento
            ')
            ->join('si_parcelas_contrato', 'si_parcelas_contrato.id = si_pagamentos.id_parcela', 'left')
            ->join('si_formas_pagamentos', 'si_formas_pagamentos.id = si_pagamentos.id_forma_pagamento', 'left')
            ->where('si_parcelas_contrato.id_contrato', $id_contrato)
            ->where('si_pagamentos.status !=', 'ESTORNADO')
            ->orderBy('si_pagamentos.data_pagamento', 'DESC')
            ->findAll();