project/app/Models/Admin/SI_TipoLancamentoModel.php

    public function getTiposAtivos()
    {
        return $this->where('ativo', 1)
                    ->orderBy('ordem_exibicao', 'ASC')
                    ->findAll();
---
SELECT *
FROM `si_tipo_lancamento`
WHERE `ativo` = 1
AND `si_tipo_lancamento`.`deleted_at` IS NULL
ORDER BY `ordem_exibicao` ASC